driver-tests/bpelse/assign/AssignBpel/build/simpleExpression/simpExpr.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="simpExpr" targetNamespace="http://j2ee.netbeans.org/wsdl/simpExpr"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/simpExpr" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="simpExprOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="simpExprOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="simpExprPortType">
        <wsdl:operation name="simpExprOperation">
            <wsdl:input name="input1" message="tns:simpExprOperationRequest"/>
            <wsdl:output name="output1" message="tns:simpExprOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="simpExprBinding" type="tns:simpExprPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="simpExprOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/simpExpr"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/simpExpr"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="simpExprService">
        <wsdl:port name="simpExprPort" binding="tns:simpExprBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/simpExprService/simpExprPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="simpExpr1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="simpExprPortTypeRole" portType="tns:simpExprPortType"/>
    </plnk:partnerLinkType>
</definitions>
