driver-tests/bpelse/assign/AssignJbi/test/simpExpr/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sim="http://j2ee.netbeans.org/wsdl/simpExpr">
  <soapenv:Body>
    <sim:simpExprOperation>
      <part1>?string?</part1>
    </sim:simpExprOperation>
  </soapenv:Body>
</soapenv:Envelope>